biemster/ch585_nfc/ch585_nfc.c
nfca_pcd_controller_state_t nfca_pcd_wait_comm_end(void) {
	nfca_pcd_controller_state_t status;
	uint32_t overtimes;
	
	overtimes = 0;
	
	while (1) {
		status = nfca_pcd_get_comm_status();
		if ((status != NFCA_PCD_CONTROLLER_STATE_FREE) || (overtimes > (NFCA_PCD_WAIT_MAX_MS * 10))) {
			break;
		}
		
		Delay_Us(100);
		overtimes++;
	}
	
	return status;
}

uint16_t nfca_pcd_lpcd_adc_filter_buf_add(uint16_t lpcd_adc) {
	uint32_t lpcd_adc_all = 0;
	for(uint8_t i = 0; i < 7; i++) {
		gs_lpcd_adc_filter_buf[i] = gs_lpcd_adc_filter_buf[i + 1];
		lpcd_adc_all = lpcd_adc_all + gs_lpcd_adc_filter_buf[i];
	}
	gs_lpcd_adc_filter_buf[7] = lpcd_adc;
	lpcd_adc_all = lpcd_adc_all + gs_lpcd_adc_filter_buf[7];
	lpcd_adc_all = (lpcd_adc_all >> 3);
	return (uint16_t)lpcd_adc_all;
}

uint8_t nfca_pcd_lpcd_check(void) {
	uint32_t adc_value_diff;
	uint16_t adc_value;
	uint8_t res = 0;
	
	adc_value = nfca_adc_get_ant_signal();
	if(adc_value > gs_lpcd_adc_base_value) {
		adc_value_diff = adc_value - gs_lpcd_adc_base_value;
	}
	else {
		adc_value_diff = gs_lpcd_adc_base_value - adc_value;
	}
	adc_value_diff = (adc_value_diff * 1000) / gs_lpcd_adc_base_value;
	
	if((adc_value > gs_lpcd_adc_base_value) && (adc_value_diff > NFCA_PCD_LPCD_THRESHOLD_MAX_LIMIT_PERMIL)) {
		adc_value = ((uint32_t)gs_lpcd_adc_base_value * (1000 + NFCA_PCD_LPCD_THRESHOLD_MAX_LIMIT_PERMIL) / 1000);
	}
	else {
		if(adc_value_diff >= NFCA_PCD_LPCD_THRESHOLD_PERMIL) {
			res = 1;
		}

		if(adc_value < gs_lpcd_adc_base_value) {
			adc_value = gs_lpcd_adc_base_value - 1;
		}
	}
	
	gs_lpcd_adc_base_value = nfca_pcd_lpcd_adc_filter_buf_add(adc_value);
	return res;
}

// NFCA PICC functions
void nfca_picc_start() {
	R8_NFC_CMD = 0x48;
	R32_NFC_DRV =  (R32_NFC_DRV & 0xf9cf) | 0x620;

	// TMR0 will do rx from PCD, capturing the pulse trains
	R8_TMR0_CTRL_MOD = RB_TMR_ALL_CLEAR;
	R32_TMR0_DMA_BEG = (uint32_t)gs_nfca_picc_signal_buf;
	R32_TMR0_DMA_END = (uint32_t)&(gs_nfca_picc_signal_buf[NFCA_PICC_SIGNAL_BUF_SIZE]);
	R8_TMR0_CTRL_DMA = RB_TMR_DMA_LOOP | RB_TMR_DMA_ENABLE;

	R8_TMR0_INTER_EN = RB_TMR_IE_DATA_ACT;
	R8_TMR0_INT_FLAG = R8_TMR0_INT_FLAG; // clear interrupt flags
	R8_TMR0_CTRL_MOD = (RB_TMR_MODE_IN | (RiseEdge_To_RiseEdge << 6) | RB_TMR_FREQ_13_56 | RB_TMR_COUNT_EN);
	NVIC_EnableIRQ(TMR0_IRQn);

	// TMR3 does PWM output for the tx to PCD, and also abuse the DMA PWM output mode to time the reponses on the FDT (Frame Delay Timing)
	R8_TMR3_CTRL_MOD = RB_TMR_ALL_CLEAR;

	R32_TMR3_CNT_END = TMR3_NFCA_PICC_CNT_END;
	R32_TMR3_FIFO = TMR3_CTRL_PWM_OFF;
	gs_nfca_picc_tx_buf[0] = TMR3_CTRL_PWM_OFF;
	R32_TMR3_DMA_BEG = (uint32_t)gs_nfca_picc_tx_buf;
	R32_TMR3_DMA_END = (uint32_t)&gs_nfca_picc_tx_buf[1];

	R8_TMR3_INT_FLAG = RB_TMR_IF_DMA_END; // clear flag
	R8_TMR3_INTER_EN = RB_TMR_IE_DMA_END;

	// Start the timer, which starts the whole DMA-driven transmission process
	R8_TMR3_CTRL_DMA = RB_TMR_DMA_ENABLE;
	R8_TMR3_CTRL_MOD = (RB_TMR_OUT_EN | (High_Level << 4) | (PWM_Times_4 << 6) | RB_TMR_FREQ_13_56 | RB_TMR_COUNT_EN);
	NVIC_EnableIRQ(TMR3_IRQn); // for tx
}

// ISO 14443-3A functions
uint16_t ISO14443_CRCA(uint8_t *buf, uint8_t len) {
	uint8_t *data = buf;
	uint16_t crc = 0x6363;
	uint8_t ch;
	while (len--) {
		ch = *data++ ^ crc;
		ch = ch ^ (ch << 4);
		crc = (crc >> 8) ^ (ch << 8) ^ (ch << 3) ^ (ch >> 4);
	}
	return crc;
}

uint16_t ISO14443AAppendCRCA(void *buf, uint16_t len) {
	uint16_t crc = 0x6363;
	uint8_t *data = (uint8_t *) buf;
	uint8_t byte8 = 0;
	
	while (len--) {
		byte8 = *data++;
		byte8 ^= crc & 0xFF;
		byte8 ^= byte8 << 4;

		crc = ((((uint16_t)byte8 << 8) | (((crc) >> 8) & 0xFF))
				^ (uint8_t)(byte8 >> 4)
				^ ((uint16_t)byte8 << 3));
	}
	
	data[0] = (crc >> 0) & 0x00FF;
	data[1] = (crc >> 8) & 0x00FF;
	
	return crc;
}

uint8_t ISO14443ACheckOddParityBit(uint8_t *data, uint8_t *parity, uint16_t len) {
	for (int i = 0; i < len; i++) {
		if ((byteParityBitsTable[data[i]]) != parity[i]) {
			return 0;
		}
	}
	return 1;
}

void ISO14443ACalOddParityBit(uint8_t *data, uint8_t *out_parity, uint16_t len) {
	for (int i = 0; i < len; i++) {
		out_parity[i] = byteParityBitsTable[data[i]];
	}
}

// PCD functions
uint16_t PcdRequest(uint8_t req_code) {
	nfca_pcd_controller_state_t status;
	
	g_nfca_pcd_send_buf[0] = req_code;
	nfca_pcd_wait_us(200);

	if(nfca_pcd_comm(7, NFCA_PCD_REC_MODE_COLI, 0) == 0) {
		status = nfca_pcd_wait_comm_end();
		
		if((status == NFCA_PCD_CONTROLLER_STATE_DONE) || (status == NFCA_PCD_CONTROLLER_STATE_COLLISION)) {
			if(g_nfca_pcd_recv_bits == (2 * 9)) {
				if(ISO14443ACheckOddParityBit(g_nfca_pcd_recv_buf, g_nfca_parity_buf, 2)) {
					return ((uint16_t *)(g_nfca_pcd_recv_buf))[0];
				}
				else {
					printf("ODD BIT ERROR\n");
					printf("data: 0x%02x 0x%02x\n", ((uint16_t *)(g_nfca_pcd_recv_buf))[0], ((uint16_t *)(g_nfca_pcd_recv_buf))[1]);
					printf("parity: %d %d\n", g_nfca_parity_buf[0], g_nfca_parity_buf[1]);
				}
			}
			else {
				printf("BITS NUM ERROR: %ld, 0x%04x\n", g_nfca_pcd_recv_bits, ((uint16_t *)(g_nfca_pcd_recv_buf))[0]);
			}
		}
		else {
			printf("STATUS ERROR %d:", status);
			switch(status) {
			case NFCA_PCD_CONTROLLER_STATE_OVERTIME:
				printf(" OVERTIME\n");
				break;
			case NFCA_PCD_CONTROLLER_STATE_ERR:
				printf(" ERR\n");
				break;
			default:
				printf(" UNKNOWN\n");
				break;
			}
		}
	}
	else {
		printf("COMMUNICATE ERROR\n");
	}
	
	return 0;
}

uint16_t PcdAnticoll(uint8_t cmd) {
	nfca_pcd_controller_state_t status;
	uint16_t res = PCD_COMMUNICATE_ERROR;
	
	g_nfca_pcd_send_buf[0] = cmd;
	g_nfca_pcd_send_buf[1] = 0x20;
	
	nfca_pcd_wait_ms(PCD_ANTICOLL_OVER_TIME);
	ISO14443ACalOddParityBit((uint8_t *)g_nfca_pcd_send_buf, (uint8_t *)g_nfca_parity_buf, 2);

	if (nfca_pcd_comm(16, NFCA_PCD_REC_MODE_NORMAL, 0) == 0) {
		status = nfca_pcd_wait_comm_end();
		
		if(status == NFCA_PCD_CONTROLLER_STATE_DONE) {
			if (g_nfca_pcd_recv_bits == (5 * 9)) {
				if (ISO14443ACheckOddParityBit(g_nfca_pcd_recv_buf, g_nfca_parity_buf, 5)) {
					if (ISO14443A_CHECK_BCC(g_nfca_pcd_recv_buf)) {
						res = PCD_NO_ERROR;
					}
					else {
						res = PCD_BCC_ERROR;
						printf("check bcc error\n");
					}
				}
				else {
					res = PCD_ODD_PARITY_ERROR;
					printf("ODD BIT ERROR\n");
				}
			}
		}
	}
	
	return res;
}

