biemster/ch585_nfc/ch585_nfc.c
uint16_t PcdSelect(uint8_t cmd, uint8_t *pSnr)
{
	nfca_pcd_controller_state_t status;
	uint16_t res = PCD_COMMUNICATE_ERROR;
	
	g_nfca_pcd_send_buf[0] = cmd;
	g_nfca_pcd_send_buf[1] = 0x70;
	g_nfca_pcd_send_buf[6] = 0;
	nfca_pcd_wait_ms(PCD_SELECT_OVER_TIME);
	for (res = 0; res < 4; res++) {
		g_nfca_pcd_send_buf[res + 2] = *(pSnr + res);
		g_nfca_pcd_send_buf[6] ^= *(pSnr + res);
	}
	ISO14443AAppendCRCA((uint8_t *)g_nfca_pcd_send_buf, 7);
	
	ISO14443ACalOddParityBit((uint8_t *)g_nfca_pcd_send_buf, (uint8_t *)g_nfca_parity_buf, 9);
	
	if (nfca_pcd_comm(9 * 8, NFCA_PCD_REC_MODE_NORMAL, 0) == 0) {
		status = nfca_pcd_wait_comm_end();
		
		if(status == NFCA_PCD_CONTROLLER_STATE_DONE) {
			if (g_nfca_pcd_recv_bits == (3 * 9)) {
				if (ISO14443ACheckOddParityBit(g_nfca_pcd_recv_buf, g_nfca_parity_buf, 3)) {
					if (ISO14443_CRCA((uint8_t *)g_nfca_pcd_recv_buf, 3) == 0) {
						// g_m1_crypto1_cipher.is_encrypted = 0;
						res = PCD_NO_ERROR;
					}
					else {
						res = PCD_CRC_ERROR;
						printf("check crc error\n");
					}
				}
				else {
					res = PCD_ODD_PARITY_ERROR;
					printf("ODD BIT ERROR\n");
				}
			}
		}
	}
	
	return res;
}

void PcdHalt(void) {
	nfca_pcd_wait_ms(5);
	
	g_nfca_pcd_send_buf[0] = PICC_HALT;
	g_nfca_pcd_send_buf[1] = 0;
	
	g_nfca_pcd_send_buf[2] = 0x57;
	g_nfca_pcd_send_buf[3] = 0xcd;
	
	ISO14443ACalOddParityBit((uint8_t *)g_nfca_pcd_send_buf, (uint8_t *)g_nfca_parity_buf, 4);
	
	nfca_pcd_comm((4 * 8), NFCA_PCD_REC_MODE_NORMAL, 0);
	nfca_pcd_wait_comm_end();
}

// test
void nfca_pcd_test() {
	uint16_t res;

	int vdd_value = ADC_VoltConverSignalPGA_MINUS_12dB( sys_get_vdd() );
	if(vdd_value > 3400) {
		NFCA_PCD_SET_OUT_DRV(NFCA_PCD_DRV_CTRL_LEVEL0);
		printf("NFC drive lvl0\n");
	}
	else if(vdd_value > 3000) {
		NFCA_PCD_SET_OUT_DRV(NFCA_PCD_DRV_CTRL_LEVEL1);
		printf("NFC drive lvl1\n");
	}
	else if(vdd_value > 2600) {
		NFCA_PCD_SET_OUT_DRV(NFCA_PCD_DRV_CTRL_LEVEL2);
		printf("NFC drive lvl2\n");
	}
	else {
		NFCA_PCD_SET_OUT_DRV(NFCA_PCD_DRV_CTRL_LEVEL3);
		printf("NFC drive lvl3\n");
	}

	while(1) {
		nfca_pcd_start();

		if(nfca_pcd_lpcd_check()) {
			printf("* card detected\n");
			
			//either blink(...) or Delay_Ms(5)
			blink(2);
			// Delay_Ms(5);
	
			res = PcdRequest(PICC_WUPA);
			if(res == 0x0004) { /* Mifare Classic */
				res = PcdAnticoll(PICC_ANTICOLL1);
				if (res == PCD_NO_ERROR) {
					picc_uid[0] = g_nfca_pcd_recv_buf[0];
					picc_uid[1] = g_nfca_pcd_recv_buf[1];
					picc_uid[2] = g_nfca_pcd_recv_buf[2];
					picc_uid[3] = g_nfca_pcd_recv_buf[3];
					printf("Mifare Classic uid: %02x %02x %02x %02x\n", picc_uid[0], picc_uid[1], picc_uid[2], picc_uid[3]);
	
					res = PcdSelect(PICC_ANTICOLL1, picc_uid);
					if (res == PCD_NO_ERROR) {
						printf("select OK, SAK:%02x\n", g_nfca_pcd_recv_buf[0]);
						PcdHalt();
					}
				}
			}
			else if(res == 0x0044) { /* Mifare Ultralight, NFC Forum Type2 */
				res = PcdAnticoll(PICC_ANTICOLL1);
				if (res == PCD_NO_ERROR) {
					if(g_nfca_pcd_recv_buf[0] == 0x88) {
						picc_uid[0] = g_nfca_pcd_recv_buf[1];
						picc_uid[1] = g_nfca_pcd_recv_buf[2];
						picc_uid[2] = g_nfca_pcd_recv_buf[3];
	
						res = PcdSelect(PICC_ANTICOLL1, g_nfca_pcd_recv_buf);
						if (res == PCD_NO_ERROR) {
							res = PcdAnticoll(PICC_ANTICOLL2);
							if (res == PCD_NO_ERROR) {
								picc_uid[3] = g_nfca_pcd_recv_buf[0];
								picc_uid[4] = g_nfca_pcd_recv_buf[1];
								picc_uid[5] = g_nfca_pcd_recv_buf[2];
								picc_uid[6] = g_nfca_pcd_recv_buf[3];
								printf("Mifare Ultralight uid: %02x %02x %02x %02x %02x %02x %02x\n", picc_uid[0], picc_uid[1],
										picc_uid[2], picc_uid[3], picc_uid[4], picc_uid[5], picc_uid[6]);
				
								res = PcdSelect(PICC_ANTICOLL2, g_nfca_pcd_recv_buf);
								if (res == PCD_NO_ERROR) {
									printf("select OK, SAK: %02x\n", g_nfca_pcd_recv_buf[0]);
									PcdHalt();

									printf("* Found an Ultralight, switching from PCD to PICC emulation.\n");
									nfca_pcd_stop();
									break;
								}
							}
							else {
								printf("ERROR ANTICOLL2\n");
							}
						}
						else {
							printf("CARD PcdSelect error: %d\n", res);
						}
					}
					else {
						printf("ERROR UID0\n");
					}
				}
			}
			else {
				printf("unknown type (ATQA: 0x%04x)\n", res);
			}
		}

		nfca_pcd_stop();
		Delay_Ms(500);
	}
}

static inline uint8_t check_parity(uint8_t bit_str[]) {
	char expected = '1';
	for(int i = 0; i < 8; i++) {
		if(bit_str[i] == '1') {
			expected = (expected == '1') ? '0' : '1';
		}
	}
	return (bit_str[8] == expected) ? 1 : 0;
}

static inline uint8_t bits_to_byte(uint8_t bit_str[]) {
	uint8_t byte_val = 0;
	for (int i = 0; i < 8; ++i) {
		if (bit_str[i] == '1') {
			byte_val |= (1 << i);
		}
	}
	return byte_val;
}

static inline uint8_t bits_to_frame(uint8_t bit_str[], int len) {
	// this is reusing (overwriting!) the input bit string!
	uint8_t num_bytes = 0;
	if(bit_str[0] != '0' || bit_str[len -1] != '0') {
		printf("* ERROR in bits_to_frame: SOF/EOF not zero\n");
	}
	else if((len -2) % 9) { // frame len is 9 bits per byte, + SOF,EOF
		printf("* ERROR in bits_to_frame: bit string is incomplete\n");
	}
	else {
		for(int i = 1; i < (len -1); i += 9) {
			if(check_parity(&bit_str[i])) {
				bit_str[num_bytes++] = bits_to_byte(&bit_str[i]);
			}
			else {
				printf("* ERROR in bits_to_frame: wrong parity of byte at index %d\n", i);
			}
		}
	}

	return num_bytes;
}

__HIGH_CODE
int decode_pulses_to_bits(uint16_t pulses[], int len, uint8_t *result_buf) {
	int bit_idx = 0;
	result_buf[bit_idx++] = '0'; // Initial state starts with a '0' bit

	for (int i = 0; i < len; ++i) {
		uint8_t last_bit = result_buf[bit_idx - 1];
		uint16_t pulse = pulses[i];

		if (last_bit == '0') {
			if (TMR0_NFCA_PICC_IS_1ETU(pulse)) {
				result_buf[bit_idx++] = '0';
			}
			else if (TMR0_NFCA_PICC_IS_1_5ETU(pulse)) {
				result_buf[bit_idx++] = '1';
			}
			else {
				return -1;
			}
		}
		else { // last_bit == '1'
			if (TMR0_NFCA_PICC_IS_1ETU(pulse)) {
				result_buf[bit_idx++] = '1';
			}
			else if (TMR0_NFCA_PICC_IS_1_5ETU(pulse)) {
				result_buf[bit_idx++] = '0';
				result_buf[bit_idx++] = '0';
			}
			else if (TMR0_NFCA_PICC_IS_2ETU(pulse)) {
				result_buf[bit_idx++] = '0';
				result_buf[bit_idx++] = '1';
			}
			else {
				return -1;
			}
		}
	}

