biemster/ch585_nfc/ch585_nfc.c
	return bit_idx; // Return the number of bits decoded
}

__HIGH_CODE
static uint16_t nfca_manchester_encode(int frame_delay_time, const uint8_t *data, uint8_t num_bytes) {
	uint16_t dma_idx = 0;
	uint8_t parity;

	gs_nfca_picc_tx_buf[dma_idx++] = TMR3_CTRL_PWM_OFF;
	for(int i = 0; i < frame_delay_time -1; i++) {
		gs_nfca_picc_tx_buf[dma_idx++] = TMR3_CTRL_PWM_OFF;
	}

	// Start of Frame (SOF)
	gs_nfca_picc_tx_buf[dma_idx++] = TMR3_CTRL_PWM_ON;
	gs_nfca_picc_tx_buf[dma_idx++] = TMR3_CTRL_PWM_OFF;

	for (uint8_t i = 0; i < num_bytes; i++) {
		uint8_t current_byte = data[i];
		parity = 0;

		// 8 data bits
		for (uint8_t j = 0; j < 8; j++) {
			uint8_t bit = (current_byte >> j) & 1;
			parity ^= bit;
			if (bit) { // '1' bit (High then Low subcarrier)
				gs_nfca_picc_tx_buf[dma_idx++] = TMR3_CTRL_PWM_ON;
				gs_nfca_picc_tx_buf[dma_idx++] = TMR3_CTRL_PWM_OFF;
			}
			else { // '0' bit (Low then High subcarrier)
				gs_nfca_picc_tx_buf[dma_idx++] = TMR3_CTRL_PWM_OFF;
				gs_nfca_picc_tx_buf[dma_idx++] = TMR3_CTRL_PWM_ON;
			}
		}

		// Parity bit (odd parity)
		if (parity) { // Parity is 1, send a '0' bit to make total odd
			gs_nfca_picc_tx_buf[dma_idx++] = TMR3_CTRL_PWM_OFF;
			gs_nfca_picc_tx_buf[dma_idx++] = TMR3_CTRL_PWM_ON;
		} else { // Parity is 0, send a '1' bit
			gs_nfca_picc_tx_buf[dma_idx++] = TMR3_CTRL_PWM_ON;
			gs_nfca_picc_tx_buf[dma_idx++] = TMR3_CTRL_PWM_OFF;
		}
	}

	// End of Frame
	gs_nfca_picc_tx_buf[dma_idx++] = TMR3_CTRL_PWM_OFF;
	gs_nfca_picc_tx_buf[dma_idx++] = TMR3_CTRL_PWM_OFF;

	return dma_idx;
}

__HIGH_CODE
void wch_nfca_picc_prepare_tx_dma(int silence, uint8_t *data, uint8_t num_bytes) {
	// Encode the data into the DMA buffer format
	uint16_t dma_len = nfca_manchester_encode(silence, data, num_bytes);
	R32_TMR3_DMA_BEG = (uint32_t)gs_nfca_picc_tx_buf;
	R32_TMR3_DMA_END = (uint32_t)&gs_nfca_picc_tx_buf[dma_len +1];
}

__INTERRUPT
__HIGH_CODE
void TMR0_IRQHandler(void) {
	R8_TMR0_INT_FLAG = R8_TMR0_INT_FLAG;	// Acknowledge

	// Get the index of the NEXT free spot in the DMA buffer.
	int current_dma_idx = (R32_TMR0_DMA_NOW - R32_TMR0_DMA_BEG) / sizeof(uint32_t);
	while(gs_picc_last_processed_dma_idx != current_dma_idx) {
		uint16_t value_from_dma = (uint16_t)gs_nfca_picc_signal_buf[gs_picc_last_processed_dma_idx];

		// rise to rise timings are never below one et_u (128 ticks in our case) or more than 2 et_u (101)
		if(TMR0_NFCA_PICC_IS_1ETU(value_from_dma) ||
			TMR0_NFCA_PICC_IS_1_5ETU(value_from_dma) ||
			TMR0_NFCA_PICC_IS_2ETU(value_from_dma)) {
			gs_nfca_data_buf[gs_picc_data_idx++] = value_from_dma;
		}
		else {
			// noise, restart pulse train capture
			gs_picc_data_idx = 0;
			gs_picc_anticoll_cmd_guess = 0;
		}

		// Advance our tracking index, wrapping around the circular DMA buffer.
		gs_picc_last_processed_dma_idx = (gs_picc_last_processed_dma_idx + 1) % NFCA_PICC_SIGNAL_BUF_SIZE;
	}

	if(gs_picc_data_idx > 4) {
		uint16_t pulse_sum = 0;
		for(int i = 0; i < 5; i++) {
			// WUPA 0x26, sum([128, 192, 192, 192, 256]) = 960
			// REQA 0x52, sum([128, 192, 128, 192, 192, ...]) = 832
			// HALT 0x50, sum([128, 128, 128, 128, 192, ...]) = 704
			// SEL1 0x93, sum([192, 128, 192, 192, 192, ...]) = 896
			// SEL2 0x95, sum([192, 256, 256, 192, 192, ...]) = 1088
			// SEL3 0x97, sum([192, 128, 128, 256, 192, ...]) = 896
			pulse_sum += gs_nfca_data_buf[i];
		}

		if(!gs_picc_anticoll_cmd_guess) {
			switch(gs_picc_data_idx) {
			case 5: // WUPA 0x26, [128, 192, 192, 192, 256]
				if(PLUSMIN_7(pulse_sum, 960)) { // WUPA
					gs_picc_anticoll_cmd_guess = PICC_WUPA;
				}
				break;
			case 6: // REQA 0x52, [128, 192, 128, 192, 192, 192]
				if(PLUSMIN_7(pulse_sum, 832)) { // REQA
					gs_picc_anticoll_cmd_guess = PICC_REQA;
				}
				break;
			case 7: // HALT 0x50, SEL1 0x93, SEL1 0x95, SEL1 0x97
				if(PLUSMIN_7(pulse_sum, 704)) { // HALT
					gs_picc_anticoll_cmd_guess = PICC_HALT;
				}
				else if(PLUSMIN_7(pulse_sum, 896) || // SEL1,3
						PLUSMIN_7(pulse_sum, 1088)) { // SEL2
					switch(gs_nfca_data_buf[2] >> 3) { // >> 3 = +/-7
					case 192 >> 3:
						gs_picc_anticoll_cmd_guess = PICC_ANTICOLL1;
						break;
					case 256 >> 3:
						gs_picc_anticoll_cmd_guess = PICC_ANTICOLL2;
						break;
					case 128 >> 3:
						gs_picc_anticoll_cmd_guess = PICC_ANTICOLL3;
						break;
					}
				}
				break;
			}
		}

		// set TMR3 timer for preparing response
		if(gs_picc_anticoll_cmd_guess && (gs_picc_state != PICC_STATE_SEND_RESP)) {
			gs_picc_state = PICC_STATE_WAIT_FOR_SEND_RESP;

			R8_TMR3_CTRL_MOD = RB_TMR_ALL_CLEAR;
			R32_TMR3_FIFO = TMR3_CTRL_PWM_OFF;
			gs_nfca_picc_tx_buf[0] = TMR3_CTRL_PWM_OFF;
			gs_nfca_picc_tx_buf[1] = TMR3_CTRL_PWM_OFF; // _ON to check if it waits long enough for a PCD pulse
			gs_nfca_picc_tx_buf[2] = TMR3_CTRL_PWM_OFF;
			gs_nfca_picc_tx_buf[3] = TMR3_CTRL_PWM_OFF; // _ON to check if it waits long enough for a PCD pulse
			gs_nfca_picc_tx_buf[4] = TMR3_CTRL_PWM_OFF;
			R32_TMR3_DMA_BEG = (uint32_t)gs_nfca_picc_tx_buf;
			R32_TMR3_DMA_END = (uint32_t)&gs_nfca_picc_tx_buf[5];

			R8_TMR3_INT_FLAG = RB_TMR_IF_DMA_END; // clear flag
			R8_TMR3_INTER_EN = RB_TMR_IE_DMA_END;

			// Start the timer by enabling the DMA-driven PWM output
			R8_TMR3_CTRL_DMA = RB_TMR_DMA_ENABLE;
			R8_TMR3_CTRL_MOD = (RB_TMR_OUT_EN | (High_Level << 4) | (PWM_Times_4 << 6) | RB_TMR_FREQ_13_56 | RB_TMR_COUNT_EN);
		}
	}

	NVIC_ClearPendingIRQ(TMR0_IRQn);
}

__INTERRUPT
__HIGH_CODE
void TMR3_IRQHandler(void) {
	R8_TMR3_INT_FLAG = R8_TMR3_INT_FLAG; // Acknowledge

	switch(gs_picc_state) {
	case PICC_STATE_WAIT_FOR_SEND_RESP:
		switch(gs_picc_anticoll_cmd_guess) {
		case PICC_REQA:
		case PICC_WUPA:
			gs_picc_state = PICC_STATE_SEND_RESP;

			R32_TMR3_FIFO = TMR3_CTRL_PWM_OFF;
			gs_picc_req_resp[0] = 0x44;
			gs_picc_req_resp[1] = 0x00;
			wch_nfca_picc_prepare_tx_dma(/*silence=*/TMR3_NFCA_PICC_FTD, gs_picc_req_resp, 2);
	
			R8_TMR3_INT_FLAG = RB_TMR_IF_DMA_END; // clear flag
			R8_TMR3_INTER_EN = RB_TMR_IE_DMA_END;
	
			// Start the timer, which starts the whole DMA-driven transmission process
			R8_TMR3_CTRL_DMA = RB_TMR_DMA_ENABLE;
			break;
		case PICC_HALT:
			// no response
			gs_picc_state = PICC_STATE_FREE;
			R8_TMR3_CTRL_DMA = 0;
			R8_TMR3_INTER_EN = 0;
			break;
		case PICC_ANTICOLL1:
		case PICC_ANTICOLL2:
		case PICC_ANTICOLL3:
			gs_picc_state = PICC_STATE_FREE;
			R8_TMR3_CTRL_DMA = 0;
			R8_TMR3_INTER_EN = 0;
			break;
		}
		break;
	case PICC_STATE_SEND_RESP: // Fall-through to _FREE, because we finished sending the response
	case PICC_STATE_FREE:
		gs_picc_state = PICC_STATE_FREE;
		R8_TMR3_CTRL_DMA = 0;
		R8_TMR3_INTER_EN = 0;
		break;
	}

	NVIC_ClearPendingIRQ(TMR3_IRQn);
}

int main() {
	SystemInit();

	funGpioInitAll(); // no-op on ch5xx

	funPinMode( LED, GPIO_CFGLR_OUT_2Mhz_PP );

	printf("~ ch585 NFC ~\n");
	printf("* Waiting for Mifare Ultralight.\n");
	blink(5);
	
	nfca_init();
	// nfca_pcd_lpcd_calibration();
	// nfca_pcd_test(); // handles nfca_pcd_start() and _stop()

	printf("* Emulating Ultralight with uid %02x %02x %02x %02x %02x %02x %02x\n",
			picc_uid[0], picc_uid[1], picc_uid[2], picc_uid[3], picc_uid[4], picc_uid[5], picc_uid[6]);

	nfca_picc_start();

	while(1);
}
